app/Controllers/BookController.php

    public function myBooks()
    {
        $loanModel = new LoanModel();
        $bookModel = new BookModel();
        $userId = session()->get('user')['id'];

        // Obtenir les prêts de l'utilisateur
        $loans = $loanModel->getUserLoans($userId);

        // Récupérer les détails des livres empruntés
        $books = [];
        foreach ($loans as $loan) {
            $book = $bookModel->find($loan['book_id']);
---
SELECT *
FROM `books`
WHERE `books`.`id` = '1'

    public function borrow($bookId)
    {
        $loanModel = new LoanModel();
        $bookModel = new BookModel();

        // Récupérer les détails du livre
        $book = $bookModel->find($bookId);

        // Vérifier si le livre est disponible
        if ($book['stock'] > 0) {
            // Créer une nouvelle entrée de prêt
            $dueDate = date('Y-m-d', strtotime('+15 days')); // Date d'échéance 15 jours plus tard

            $loanData = [
                'book_id' => $bookId,
                'user_id' => session()->get('user')['id'],
                'loan_date' => date('Y-m-d'),
                'due_date' => $dueDate,
            ];

            // Insérer les données d'emprunt
            $loanModel->insert($loanData);

            // Réduire le stock du livre
            $bookModel->update($bookId, ['stock' => $book['stock'] - 1]);
---
SELECT *
FROM `books`
WHERE `books`.`id` = '4'
INSERT INTO `loans` (`book_id`, `user_id`, `loan_date`, `due_date`) VALUES ('4', '4', '2024-08-30', '2024-09-14')
UPDATE `books` SET `stock` = 0
WHERE `books`.`id` IN ('4')

    public function returnBook($bookId)
    {
        $loanModel = new LoanModel();
        $bookModel = new BookModel();
        $userId = session()->get('user')['id'];

        // Trouver le prêt correspondant
        $loan = $loanModel->where('book_id', $bookId)
                          ->where('user_id', $userId)
                          ->first();

        if ($loan) {
            // Supprimer l'entrée de prêt
            $loanModel->delete($loan['id']);

            // Récupérer les détails du livre
            $book = $bookModel->find($bookId);

            // Augmenter le stock du livre
            $bookModel->update($bookId, ['stock' => $book['stock'] + 1]);
---
SELECT *
FROM `loans`
WHERE `book_id` = '4'
AND `user_id` = '4'
 LIMIT 1
DELETE FROM `loans`
WHERE `id` IN ('10')
SELECT *
FROM `books`
WHERE `books`.`id` = '4'
UPDATE `books` SET `stock` = 5
WHERE `books`.`id` IN ('4')