app/Controllers/Dashboard.php

SELECT *
FROM `books`
WHERE `title` LIKE '%ro%' ESCAPE '!'
OR  `author` LIKE '%ro%' ESCAPE '!'
OR  `type` LIKE '%ro%' ESCAPE '!'
ORDER BY `title` ASC
---
    public function index()
    {
        $model = new BookModel();

        // Récupérer les paramètres de recherche, de tri et de direction
        $search = $this->request->getGet('search');
        $sort = $this->request->getGet('sort');
        $direction = $this->request->getGet('direction');

        // Construire la requête de tri
        if ($sort && $direction) {
            $model->orderBy($this->getSortColumn($sort), $direction);
        }

        // Appliquer le filtre de recherche
        if ($search) {
            $model->like('title', $search)
                  ->orLike('author', $search)
                  ->orLike('type', $search);
        }

        $books = $model->findAll();