app/Controllers/Dashboard.php

    public function index()
    {
        $model = new BookModel();
        $data['books'] = $model->findAll();  // Récupère tous les livres
---
SELECT *
FROM `books`