app/Controllers/Login.php

    public function process()
    {
        $model = new UserModel();
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        // Vérification de l'utilisateur
        $user = $model->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'manoa@ispm.com'
 LIMIT 1