app/Controllers/Register.php

    public function process()
    {
        $model = new UserModel();
        $password = $this->request->getPost('password');

        $hash = password_hash($password, PASSWORD_DEFAULT);
        $data = [
            'name' => $this->request->getPost('name'),
            'email' => $this->request->getPost('email'),
            'password' => $hash,
        ];
        $model->insert($data);
---
INSERT INTO `users` (`name`, `email`, `password`) VALUES ('Manoa', 'manoa@ispm.com', '$2y$10$kTLzSoZb9PL2lPjHgNTCOOLMQCdTyX.g4PLzj7UwvyTvP.gMSnXMi')