app/Models/LoanModel.php

    public function getUserLoans($userId)
    {
        return $this->where('user_id', $userId)->findAll();
---
SELECT *
FROM `loans`
WHERE `user_id` = '4'